feat: added features from issues
